app/Controllers/StatusKirimController.php

SELECT *
FROM `transaksi`
---
			public function index()
			{
				$data['transaksis'] = $this->transaksi->findAll();

UPDATE `transaksi` SET `status` = '1'
WHERE `transaksi`.`id` IN ('4')
---
			public function edit($id)
			{
				$data = $this->request->getPost();

				if($data>0){
                    $dataForm = ['status' => $this->request->getPost('status')];
					$this->transaksi->update($id, $dataForm);