app/Controllers/UserController.php

SELECT *
FROM `user`
---
			public function index()
			{
				$data['users'] = $this->user->findAll();

UPDATE `user` SET `is_active` = '0'
WHERE `user`.`id` IN ('5')
---
			public function edit($id)
			{
				$data = $this->request->getPost();

				if($data>0){
                    if($this->request->getPost('editRole')==1){
                        $dataForm = [
                            'role' => $this->request->getPost('role')
                        ];
                    } else {
                        $dataForm = [
                            'is_active' => $this->request->getPost('is_active')
                        ];
                    }

					$this->user->update($id, $dataForm);